Usage: ./cab-crisa-2 <TS-file-name> [<USCM ID> [<JMDC ID> [<P>]]]
File    = cab-library/Sequences/CCS Sequences/Ramp-up-Sequence-CPU_N-SettingTo_D82h_V1.TS
USCM ID = 0x18
JMDC ID = 3
P       = 0
/// RAMP UP SEQUENCE (26 June 2008)
/// Power 28V_N ON
   9:SET PS OUTPUT VOLTAGE         :PWS-02, 28V_POWER_BUS_N, 28000
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 14, SEC
   2:SELECT CAB CPU                :UTC-03, CPU_N
/// CPU_N in Start up state
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A D9 0C 1A 82 00 00 67 97 06 5A 00 0E 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  13:SEND COMMAND                  :CAN-02, C0A, CAB_LATCHUP_PROTECT_ENABLE.CMM, 0
Command: 0A 0A 04 5F 
err = 0000
Response: 
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A DF 0C 1A 82 00 00 67 97 06 5A 00 0E 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  16:SEND COMMAND                  :CAN-02, C18, CAB_LOAD_APSW_SW_PROGRAM_1.CMM, 0
Command: 0A 18 04 A2 
err = 10FC = Command not allowed in Current State
  17:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  18:SEND COMMAND                  :CAN-02, C1B, CAB_GO_APSW.CMM, 0
Command: 0A 1B 07 00 00 00 00 
err = 10FC = Command not allowed in Current State
  19:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  20:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A E7 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Power 28V_R ON
   9:SET PS OUTPUT VOLTAGE         :PWS-02, 28V_POWER_BUS_R, 28000
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 14, SEC
   2:SELECT CAB CPU                :UTC-03, CPU_R
/// CPU_R in Start up state
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A EB 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  13:SEND COMMAND                  :CAN-02, C0A, CAB_LATCHUP_PROTECT_ENABLE.CMM, 0
Command: 0A 0A 04 5F 
err = 0000
Response: 
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A F1 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Power CSP Electronis ON from CPU_N
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 14, SEC
  37:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL1_ON.CMM, 0
Command: 0A B7 05 03 5F 
err = 0000
Response: 
  38:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A F8 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  39:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL2_ON.CMM, 0
Command: 0A B7 05 04 5F 
err = 0000
Response: 
  40:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6A FF 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  41:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL3_ON.CMM, 0
Command: 0A B7 05 05 5F 
err = 0000
Response: 
  42:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 06 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  44:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD1_ON.CMM, 0
Command: 0A B7 05 00 5F 
err = 0000
Response: 
  45:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 0D 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  46:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD2_ON.CMM, 0
Command: 0A B7 05 01 5F 
err = 0000
Response: 
  47:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 14 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  48:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD3_ON.CMM, 0
Command: 0A B7 05 02 5F 
err = 0000
Response: 
  49:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 1C 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  51:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CTRL_NOM_ON.CMM, 0
Command: 0A B7 05 06 5F 
err = 0000
Response: 
  52:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 23 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  61:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  64:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CTRL_RED_ON.CMM, 0
Command: 0A B7 05 07 5F 
err = 0000
Response: 
  65:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 2A 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  61:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
/// Nominal & Redundant Battery Charger LCL first OFF and then ON from CPU_N
   1:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_NOM_OFF.CMM, 0
Command: 0A B8 05 01 50 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 31 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
   7:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_NOM_ON.CMM, 0
Command: 0A B8 05 01 5F 
err = 0000
Response: 
   8:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 38 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
   4:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_RED_OFF.CMM, 0
Command: 0A B8 05 02 50 
err = 0000
Response: 
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 3F 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
  10:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_RED_ON.CMM, 0
Command: 0A B8 05 02 5F 
err = 0000
Response: 
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 46 0C 1A 82 00 00 67 97 06 5A 00 10 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Nominal CPU is active
/// CSP_N FPGA_1N &  FPGA_2N Parameter Configuration from CPU_N
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_1N_TRDS1_180min_NOM.CMM   // replaced by AL
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_2N_TRDS1_180min_NOM.CMM   // replaced by AL
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_1N_TRDS1_180min_NOM.CMM   // replaced by AL
Command: 0A 93 10 11 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_2N_TRDS1_180min_NOM.CMM   // replaced by AL
Command: 0A 93 10 21 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_1N.CMM, 0
Command: 0A CC 04 11 
err = 0000
Response: 11 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
   7:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_2N.CMM, 0
Command: 0A CC 04 21 
err = 0000
Response: 21 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
/// CSP_R FPGA_1R &  FPGA_2R Parameter Configuration from CPU_N
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_1R_TRDS1_180min_RED.CMM   // replaced by AL
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_2R_TRDS1_180min_RED.CMM   // replaced by AL
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_1R_TRDS1_180min_RED.CMM   // replaced by AL
Command: 0A 93 10 12 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_2R_TRDS1_180min_RED.CMM   // replaced by AL
Command: 0A 93 10 22 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_1R.CMM, 0
Command: 0A CC 04 12 
err = 0000
Response: 12 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
   7:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_2R.CMM, 0
Command: 0A CC 04 22 
err = 0000
Response: 22 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
/// Nominal CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Nominal CPU is inactive, now Redundant CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_R
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 6E 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Redundant CPU is active
/// Power CSP Electronis ON from CPU_R
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 72 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Power CSP Electronis ON from CPU_R
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 14, SEC
  37:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL1_ON.CMM, 0
Command: 0A B7 05 03 5F 
err = 0000
Response: 
  38:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 79 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  39:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL2_ON.CMM, 0
Command: 0A B7 05 04 5F 
err = 0000
Response: 
  40:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 80 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  41:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CL3_ON.CMM, 0
Command: 0A B7 05 05 5F 
err = 0000
Response: 
  42:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 87 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  44:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD1_ON.CMM, 0
Command: 0A B7 05 00 5F 
err = 0000
Response: 
  45:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 8E 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  46:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD2_ON.CMM, 0
Command: 0A B7 05 01 5F 
err = 0000
Response: 
  47:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 95 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  48:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_MD3_ON.CMM, 0
Command: 0A B7 05 02 5F 
err = 0000
Response: 
  49:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B 9C 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  51:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CTRL_NOM_ON.CMM, 0
Command: 0A B7 05 06 5F 
err = 0000
Response: 
  52:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B A3 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  61:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
  64:SEND COMMAND                  :CAN-02, CB7, CSP_ON_OFF_CONVERTERS_CTRL_RED_ON.CMM, 0
Command: 0A B7 05 07 5F 
err = 0000
Response: 
  65:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B AA 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  61:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
/// Nominal & Redundant Battery Charger LCL first OFF and then ON from CPU_R
   1:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_NOM_OFF.CMM, 0
Command: 0A B8 05 01 50 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B B1 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
   7:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_NOM_ON.CMM, 0
Command: 0A B8 05 01 5F 
err = 0000
Response: 
   8:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B B8 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 5, SEC
   4:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_RED_OFF.CMM, 0
Command: 0A B8 05 02 50 
err = 0000
Response: 
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B C0 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   5:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
  10:SEND COMMAND                  :CAN-02, CB8, CAB_ON_OFF_LCL_RED_ON.CMM, 0
Command: 0A B8 05 02 5F 
err = 0000
Response: 
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B C8 0C A6 82 00 00 6B 67 06 5B 00 12 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Redundant CPU is active
/// CSP_N FPGA_1N &  FPGA_2N Parameter Configuration from CPU_R
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_1N_TRDS1_180min_NOM.CMM   // replaced by AL
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_2N_TRDS1_180min_NOM.CMM   // replaced by AL
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_1N_TRDS1_180min_NOM.CMM   // replaced by AL
Command: 0A 93 10 11 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_2N_TRDS1_180min_NOM.CMM   // replaced by AL
Command: 0A 93 10 21 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_1N.CMM, 0
Command: 0A CC 04 11 
err = 0000
Response: 11 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
   7:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_2N.CMM, 0
Command: 0A CC 04 21 
err = 0000
Response: 21 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
/// CSP_R FPGA_1R &  FPGA_2R Parameter Configuration from CPU_R
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_1R_TRDS1_180min_RED.CMM   // replaced by AL
// 1:SEND COMMAND                  :CAN-02, C95, CSP_RDS_CONFIGURATION_2R_TRDS1_180min_RED.CMM   // replaced by AL
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_1R_TRDS1_180min_RED.CMM   // replaced by AL
Command: 0A 93 10 12 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, C93, CSP_RDS_CONFIGURATION_2R_TRDS1_180min_RED.CMM   // replaced by AL
Command: 0A 93 10 22 00 B4 02 58 01 2C 00 3C 00 3C 00 4B 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_1R.CMM, 0
Command: 0A CC 04 12 
err = 0000
Response: 12 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
   7:SEND COMMAND                  :CAN-02, CCC, CSP_GET_RDS_AQS_CONFIGURATION_2R.CMM, 0
Command: 0A CC 04 22 
err = 0000
Response: 22 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 
/// Redundant CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Redundant CPU is inactive, now Nominal CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_N
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6B EF 0D 32 82 00 00 6B E8 06 5B 00 14 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Nominal CPU is active
/// Nominal CPU is in active state and controls the CCS electronics configuration
   3:REQUEST MESSAGE               :GEP-05, POWER-ON 120V PS, NONE
/// 120V bus has to be powered ON
 /// Sequence to close the CL Diconnectors starts from CPU_N
/// Execute the following steps of the Ramp Down sequence from Step-1.1 to Step-6.4, detailed below
/// Power CD TMP HTR OFF
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_OFF_CD.CMM, 0
Command: 0A E1 07 01 5F 50 04 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6B F6 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6B FF 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_OFF_CD.CMM, 0
Command: 0A E1 07 02 5F 50 04 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 08 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 11 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
/// Open SC_SW
   2:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   3:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_OPEN.CMM, 0
Command: 0A 4B 04 50 
err = 0000
Response: 
// 4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DISABLE.CMM, 0                   // replaced by AL
   4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DIS.CMM, 0                       // replaced by AL
Command: 0A 4D 04 50 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_OFF.CMM, 0
Command: 0A 4E 09 50 50 50 50 50 50 
err = 0000
Response: 
// 6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0             // replaced by AL
   6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0                // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
   9:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_NOM.CMM, 0
Command: 0A 05 04 01 
err = 0000
Response: 00 00 6C 2A 00 00 0F 00 0F 00 0F 50 00 00 01 00 00 00 C0 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
/// Open the Moog Valves DV22A,  B, C & D
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_OPEN_V22A.CMM, 0
Command: 0A ED 08 01 5F 5F 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C 33 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_OPEN_V22C.CMM, 0
Command: 0A ED 08 01 5F 5F 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C 3E 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_OPEN_V22B.CMM, 0
Command: 0A ED 08 02 5F 5F 02 2B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 49 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_OPEN_V22D.CMM, 0
Command: 0A ED 08 02 5F 5F 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 55 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Power CL TMP HTR ON
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_ON_CL.CMM, 0
Command: 0A E1 07 01 5F 5F 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C 65 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C 70 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_ON_CL.CMM, 0
Command: 0A E1 07 02 5F 5F 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 7A 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C 83 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6C 89 0F FC 82 00 00 6C 86 06 5A 00 14 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Open the CL valves DV56A-B
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V56A.CMM, 0
Command: 0A E4 08 01 5F 5F 05 6A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C 90 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V56B.CMM, 0
Command: 0A E4 08 02 5F 5F 05 6B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C A0 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 600, SEC
/// Open the Disconnector pilot valves A, B, C & D
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V21A.CMM, 0
Command: 0A E4 08 01 5F 5F 02 1A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C B0 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V21C.CMM, 0
Command: 0A E4 08 01 5F 5F 02 1C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C C1 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V21B.CMM, 0
Command: 0A E4 08 02 5F 5F 02 1B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C D2 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V21D.CMM, 0
Command: 0A E4 08 02 5F 5F 02 1D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6C E2 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// CL Detection function is Enabled autonomuously
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The CL Diconnectors have been closed
/// Sequence to close the CL Diconnectors is finished from CPU_N
/// Nominal CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Nominal CPU is inactive, now Redundant CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_R
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6C F3 12 30 83 00 00 6C EC 06 55 00 16 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Redundant CPU is active
/// Sequence to close the CL Diconnectors starts from CPU_R
/// Execute the following steps of the Ramp Down sequence from Step-1.1 to Step-6.4, detailed below
/// Power CD TMP HTR OFF
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_OFF_CD.CMM, 0
Command: 0A E1 07 01 5F 50 04 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6C FA 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 03 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_OFF_CD.CMM, 0
Command: 0A E1 07 02 5F 50 04 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 0C 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 18 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
/// Open SC_SW
   2:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   3:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_OPEN.CMM, 0
Command: 0A 4B 04 50 
err = 0000
Response: 
// 4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DISABLE.CMM, 0                   // replaced by AL
   4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DIS.CMM, 0                       // replaced by AL
Command: 0A 4D 04 50 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_OFF.CMM, 0
Command: 0A 4E 09 50 50 50 50 50 50 
err = 0000
Response: 
// 6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0             // replaced by AL
   6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0                // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
   9:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_NOM.CMM, 0
Command: 0A 05 04 01 
err = 0000
Response: 00 00 6D 2F 00 00 12 00 12 00 12 50 00 00 01 00 00 00 C0 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
/// Open the Moog Valves DV22A, B, C & D
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_OPEN_V22A.CMM, 0
Command: 0A ED 08 01 5F 5F 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 38 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_OPEN_V22C.CMM, 0
Command: 0A ED 08 01 5F 5F 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 44 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_OPEN_V22B.CMM, 0
Command: 0A ED 08 02 5F 5F 02 2B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 4F 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_OPEN_V22D.CMM, 0
Command: 0A ED 08 02 5F 5F 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 5A 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Power CL TMP HTR ON
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_ON_CL.CMM, 0
Command: 0A E1 07 01 5F 5F 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 6C 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 75 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_ON_CL.CMM, 0
Command: 0A E1 07 02 5F 5F 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 7E 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D 87 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6D 8D 14 FA 82 00 00 6D 8A 06 5A 00 16 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 10, SEC
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Open the CL valves DV56A-B
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V56A.CMM, 0
Command: 0A E4 08 01 5F 5F 05 6A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D 94 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V56B.CMM, 0
Command: 0A E4 08 02 5F 5F 05 6B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D A4 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 600, SEC
/// Open the Disconnector pilot valves A, B, C & D
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V21A.CMM, 0
Command: 0A E4 08 01 5F 5F 02 1A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D B4 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_OPEN_V21C.CMM, 0
Command: 0A E4 08 01 5F 5F 02 1C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6D C7 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V21B.CMM, 0
Command: 0A E4 08 02 5F 5F 02 1B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D D7 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_OPEN_V21D.CMM, 0
Command: 0A E4 08 02 5F 5F 02 1D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6D E7 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// CL Detection function is Enabled autonomuously
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The CL Diconnectors have been closed
/// Sequence to close the CL Diconnectors is finished from CPU_R
/// Redundant CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Redundant CPU is inactive, now Nominal CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_N
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6D F8 17 2E 83 00 00 6D F1 06 55 00 18 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// CCS electronics configuration to ON state
/// Nominal CPU is active
/// Sequence for CCS electronics configuration ON starts
/// Nominal CPU is in active state and controls the CCS electronics configuration ON
   1:SEND COMMAND                  :CAN-02, C7E, PS_INTERPOINT_DRIVER_ON_OFF_NOM_ON.CMM, 0 
Command: 0A 7E 05 01 5F 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_ON.CMM, 0
Command: 0A 4E 09 5F 5F 5F 5F 5F 5F 
err = 0000
Response: 
   6:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_NOM.CMM, 0
Command: 0A 05 04 01 
err = 0000
Response: 00 00 6E 08 3F 00 14 00 14 00 14 5F 00 00 01 00 00 00 C0 
   7:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_CLOSE.CMM, 0
Command: 0A 4B 04 5F 
err = 0000
Response: 
// 8:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_ENABLE.CMM, 0                   // replaced by AL
   8:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_ENA.CMM, 0                      // replaced by AL
Command: 0A 4D 04 5F 
err = 0000
Response: 
// 9:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0            // replaced by AL
   9:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0               // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
  10:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 16 17 2E 83 00 00 6D F1 06 55 00 18 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Nominal CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Nominal CPU is inactive, now Redundant CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_R
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 1E 17 2E 83 00 00 6D F1 06 55 00 1A 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Redundant CPU is active
/// Redundant CPU is in active state and controls the CCS electronics configuration ON
   1:SEND COMMAND                  :CAN-02, C7E, PS_INTERPOINT_DRIVER_ON_OFF_RED_ON.CMM, 0
Command: 0A 7E 05 02 5F 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_ON.CMM, 0
Command: 0A 4E 09 5F 5F 5F 5F 5F 5F 
err = 0000
Response: 
   6:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_RED.CMM, 0
Command: 0A 05 04 02 
err = 0000
Response: 00 00 6E 2E 3F 00 15 00 15 00 15 5F 00 00 01 00 00 00 C0 
   7:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_CLOSE.CMM, 0
Command: 0A 4B 04 5F 
err = 0000
Response: 
// 8:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_ENABLE.CMM, 0                   // replaced by AL
   8:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_ENA.CMM, 0                      // replaced by AL
Command: 0A 4D 04 5F 
err = 0000
Response: 
// 9:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0            // replaced by AL
   9:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0               // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
  10:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 3B 17 44 83 00 00 6E 30 07 A8 00 1A 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Sequence for CCS electronics configuration ON is finished
/// Redundant CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Redundant CPU is inactive, now Nominal CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_N
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 43 17 44 83 00 00 6E 30 07 A8 00 1C 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Nominal CPU is active
/// Persistent switch HTR ON (N & R)
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_ON_PS.CMM, 0
Command: 0A E1 07 01 5F 5F 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6E 4C 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 52 17 80 82 00 00 6E 4F 05 5A 00 1C 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_ON_PS.CMM, 0
Command: 0A E1 07 02 5F 5F 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6E 5B 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 61 17 BC 82 00 00 6E 5E 06 5A 00 1C 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// CCS Current Set point commands for ramp-up ON
/// Maximum temperature at CAB baseplate level has to be lower than TBC value at the beginning of Ramping (6 CCS converters are operating)
/// Maximum temperature at CAB baseplate level has to be lower than TBC value at the beginning of Ramping (5 CCS converters are operating)
   4:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 16 00 16 00 15 
/// CCS Current Set point commands to achieve the 390.6Amps foreseen Full Current
/// Magnet Current Shunt Resistance has a value of 106.8 micro-ohms for CAB FM model (104.8 micro-ohms for CAB EM model)
/// For CAB FM model at 390.6Amps Full Current, the setting value is D82h Hexadecimal Code (3458d decimal code)
   5:INFO MESSAGE                  :GEP-06, Start sequence, NONE
   6:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR1_D82h.cmm, 0
Command: 0A 41 06 01 0D 82 
err = 10FB = Command not allowed now
   8:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR2_D82h.cmm, 0
Command: 0A 41 06 02 0D 82 
err = 10FB = Command not allowed now
  10:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR3_D82h.cmm, 0
Command: 0A 41 06 03 0D 82 
err = 10FB = Command not allowed now
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 6E 17 BC 82 00 00 6E 5E 06 5A 00 1F 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6E 72 04 1C 04 35 04 9C 04 98 04 8F 04 8A 04 7F 04 74 04 73 04 96 0F FF 04 30 04 25 04 49 04 47 0F FF 0F FF 04 99 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 04 00 00 00 00 00 01 00 2A 0F 01 
  14:SEND COMMAND                  :CAN-02, C39, CCS_START_CURRENT_SETPOINT_SEQ_V1.CMM, 0
Command: 0A 39 04 01 
err = 10FB = Command not allowed now
  15:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 86 17 BC 82 00 00 6E 5E 06 5A 00 20 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 30, SEC
/// Persistent switch HTR OFF (N & R)
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_OFF_PS.CMM, 0
Command: 0A E1 07 01 5F 50 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 6E 8F 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E 95 17 F8 82 00 00 6E 92 05 5A 00 20 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_OFF_PS.CMM, 0
Command: 0A E1 07 02 5F 50 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 6E 9E 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   7:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6E A4 18 34 82 00 00 6E A1 06 5A 00 20 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Persistent switches N & R have been open
/// Maximum temperature at CAB baseplate level has to be lower than 61ºC value at the end of Ramping (6 CCS converters are operating)
/// Maximum temperature at CAB baseplate level has to be lower than 37ºC value at the end of Ramping (5 CCS converters are operating)
/// The wait states added corresponds to a ramp-up sequence at full current of 390.6A
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 70, SEC
  18:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 16 00 16 00 16 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 500, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 16 00 16 00 16 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6E AC 00 15 00 15 00 15 00 29 00 01 00 00 00 00 00 00 00 09 00 00 00 00 00 09 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6E B4 04 1C 04 36 04 9C 04 98 04 8F 04 8A 04 7F 04 74 04 73 04 96 0F FF 04 30 04 25 04 49 04 46 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1200, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 17 00 17 00 17 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6E CA 00 16 00 16 00 16 00 29 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 06 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6E D2 04 1D 04 36 04 9C 04 98 04 8F 04 8A 04 7F 04 74 04 73 04 96 0F FF 04 30 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BF 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1800, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 17 00 17 00 17 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6E E6 00 16 00 16 00 16 00 29 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 06 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6E EE 04 1C 04 36 04 9C 04 98 04 8F 04 89 04 7F 04 74 04 73 04 96 0F FF 04 30 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 00 00 01 00 2A 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1800, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 17 00 17 00 17 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 02 00 16 00 16 00 16 00 29 00 01 00 00 00 00 00 00 00 09 00 00 00 00 00 07 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 0C 04 1C 04 35 04 9C 04 98 04 8F 04 89 04 7F 04 74 04 73 04 96 0F FF 04 30 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1800, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 18 00 18 00 18 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 21 00 17 00 17 00 17 00 28 00 01 00 00 00 00 00 00 00 09 00 00 00 00 00 09 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 29 04 1C 04 36 04 9C 04 98 04 8F 04 8A 04 7F 04 74 04 73 04 95 0F FF 04 2F 04 25 04 49 04 46 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 300, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 18 00 18 00 18 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 3D 00 17 00 17 00 17 00 29 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 09 00 51 0F B1 
  32:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6F 45 18 34 82 00 00 6E A1 06 5A 00 20 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// Ramp up Stabilization Time starts
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 49 04 1D 04 36 04 9C 04 98 04 8F 04 89 04 7F 04 74 04 73 04 96 0F FF 04 2F 04 25 04 49 04 47 0F FF 0F FF 04 99 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 180, SEC
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 5C 00 17 00 17 00 17 00 29 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 06 00 51 0F B1 
/// The Magnet Current is stable at this time
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 65 04 1D 04 35 04 9C 04 98 04 8F 04 89 04 7F 04 74 04 73 04 95 0F FF 04 2F 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 120, SEC
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 77 00 18 00 18 00 18 00 28 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 06 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 7F 04 1C 04 36 04 9C 04 98 04 8F 04 8A 04 7F 04 74 04 73 04 95 0F FF 04 30 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 300, SEC
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F 91 00 18 00 18 00 18 00 29 00 01 00 00 00 00 00 00 00 09 00 00 00 00 00 08 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F 99 04 1C 04 36 04 9C 04 97 04 8F 04 89 04 7F 04 74 04 73 04 96 0F FF 04 2F 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 300, SEC
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F AB 00 18 00 18 00 18 00 29 00 01 00 00 00 00 00 00 00 0B 00 00 00 00 00 09 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F B4 04 1C 04 35 04 9C 04 98 04 8F 04 89 04 7F 04 73 04 73 04 96 0F FF 04 2F 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C6 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 00 00 01 00 29 0F 01 
/// Ramp up Stabilization Time have been finished
/// CCS Current Set point commands for ramp-up OFF
   4:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
   5:INFO MESSAGE                  :GEP-06, Start sequence, NONE
   6:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR1_0H.CMM, 0
Command: 0A 41 06 01 00 00 
err = 10FB = Command not allowed now
   8:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR2_0H.CMM, 0
Command: 0A 41 06 02 00 00 
err = 10FB = Command not allowed now
  10:SEND COMMAND                  :CAN-02, C41, CCS_CURRENT_SETPOINT_SEQ_CURR3_0H.CMM, 0
Command: 0A 41 06 03 00 00 
err = 10FB = Command not allowed now
  11:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 6F CF 18 34 82 00 00 6E A1 06 5A 00 23 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
  12:SEND COMMAND                  :CAN-02, C39, CCS_START_CURRENT_SETPOINT_SEQ_V1.CMM, 0
Command: 0A 39 04 01 
err = 10FB = Command not allowed now
  16:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  17:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  18:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  19:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  20:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  21:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 6F E1 00 19 00 19 00 19 00 29 00 01 00 00 00 00 00 00 00 0A 00 00 00 00 00 09 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 6F E9 04 1D 04 35 04 9C 04 98 04 8F 04 89 04 7F 04 74 04 73 04 96 0F FF 04 2F 04 25 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C7 04 BE 04 58 0F FF 0F FF 0B E2 00 03 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  22:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  23:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  24:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1A 00 1A 00 1A 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 70 01 00 19 00 19 00 19 00 28 00 01 00 00 00 00 00 00 00 0B 00 00 00 00 00 08 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 70 0C 04 1C 04 35 04 9C 04 97 04 8F 04 89 04 7F 04 74 04 73 04 95 0F FF 04 2F 04 24 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C6 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 01 00 00 00 00 00 01 00 29 0F 01 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
  25:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1B 00 1B 00 1B 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 360, SEC
  26:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1B 00 1B 00 1B 
  25:SEND COMMAND                  :CAN-02, C47, CCS_ANALOG_TM_ACQUIRE.CMM, 0
Command: 0A 47 03 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
  26:SEND COMMAND                  :CAN-02, C48, CCS_READ_ANALOG_TM.CMM, 0
Command: 0A 48 03 
err = 0000
Response: 00 00 70 22 00 1A 00 1A 00 1A 00 28 00 01 00 00 00 00 00 00 00 09 00 00 00 00 00 08 00 51 0F B1 
   1:SEND COMMAND                  :CAN-02, C21, STM_ACQUIRE_NOM_ENER_ENA.CMM, 0
Command: 0A 21 05 01 5F 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 1, SEC
   2:SEND COMMAND                  :CAN-02, C22, STM_READ_NOM.CMM, 0
Command: 0A 22 04 01 
err = 0000
Response: 00 00 70 2A 04 1C 04 36 04 9C 04 97 04 8F 04 89 04 7F 04 74 04 73 04 95 0F FF 04 2F 04 24 04 49 04 47 0F FF 0F FF 04 98 0F FF 04 C7 04 C9 04 C1 04 C1 04 C6 04 BE 04 58 0F FF 0F FF 0B E2 00 02 00 0B 00 01 00 0C 00 01 00 01 00 01 00 01 00 01 00 01 00 11 00 00 00 00 00 01 00 29 0F 01 
/// The wait states added corresponds to a ramp-up OFF sequence at speed rate of V1
  64:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 70 3C 18 34 82 00 00 6E A1 06 5A 00 24 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 5F 5F 
/// CCS Current Set point commands for ramp-up OFF stage is finished
   1:SEND COMMAND                  :CAN-02, C44, CCS_READ_SETPOINT_CMDS.cmm, 0
Command: 0A 44 03 
err = 0000
Response: 00 1B 00 1B 00 1B 
/// Before starting CCS electronics configuration OFF, the programmed current setpoint must be 000h
/// Nominal CPU is in active state and controls the CCS electronics configuration OFF
   2:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   3:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_OPEN.CMM, 0
Command: 0A 4B 04 50 
err = 0000
Response: 
// 4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DISABLE.CMM, 0                   // replaced by AL
   4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DIS.CMM, 0                       // replaced by AL
Command: 0A 4D 04 50 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_OFF.CMM, 0
Command: 0A 4E 09 50 50 50 50 50 50 
err = 0000
Response: 
// 6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0             // replaced by AL
   6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0                // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
   8:SEND COMMAND                  :CAN-02, C7E, PS_INTERPOINT_DRIVER_ON_OFF_NOM_OFF.CMM, 0
Command: 0A 7E 05 01 50 
err = 0000
Response: 
   9:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_NOM.CMM, 0
Command: 0A 05 04 01 
err = 0000
Response: 00 00 70 56 00 00 1B 00 1B 00 1B 50 00 00 00 00 00 00 C0 
  10:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 70 5D 18 34 82 00 00 6E A1 06 5A 00 24 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Nominal CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Nominal CPU is inactive, now Redundant CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_R
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 70 65 18 34 82 00 00 6E A1 06 5A 00 26 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Redundant CPU is active
/// Redundant CPU is in active state and controls the CCS electronics configuration ON
   2:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_ARM.CMM, 0
Command: 0A 53 04 5F 
err = 0000
Response: 
   3:SEND COMMAND                  :CAN-02, C4B, CCS_OPEN_CLOSE_SEMIC_SW_OPEN.CMM, 0
Command: 0A 4B 04 50 
err = 0000
Response: 
// 4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DISABLE.CMM, 0                   // replaced by AL
   4:SEND COMMAND                  :CAN-02, C4D, CCS_ENA_DIS_OUTPUT_DIS.CMM, 0                       // replaced by AL
Command: 0A 4D 04 50 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, C4E, CCS_ON_OFF_CONVERTERS_ALL_OFF.CMM, 0
Command: 0A 4E 09 50 50 50 50 50 50 
err = 0000
Response: 
// 6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DISARM.CMM, 0             // replaced by AL
   6:SEND COMMAND                  :CAN-02, C53, CCS_COMMANDING_ARM_DISARM_DIS.CMM, 0                // replaced by AL
Command: 0A 53 04 50 
err = 0000
Response: 
   8:SEND COMMAND                  :CAN-02, C7E, PS_INTERPOINT_DRIVER_ON_OFF_RED_OFF.CMM, 0
Command: 0A 7E 05 02 50 
err = 0000
Response: 
   9:SEND COMMAND                  :CAN-02, C05, CAB_GET_DIGITAL_STATUS_RED.CMM, 0
Command: 0A 05 04 02 
err = 0000
Response: 00 00 70 7D 00 00 1C 00 1C 00 1C 50 00 00 00 00 00 00 C0 
  10:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 70 82 18 4A 83 00 00 70 7F 07 A8 00 26 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Redundant CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Redundant CPU is inactive, now Nominal CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_N
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 70 8A 18 4A 83 00 00 70 7F 07 A8 00 28 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Nominal CPU is active
/// Sequence to Open the CL Diconnectors starts from CPU_N
/// Execute the following steps of the Ramp Down sequence from Step-11 to Step-14, detailed below
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V21A.CMM, 0
Command: 0A E4 08 01 5F 50 02 1A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 70 91 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V21C.CMM, 0
Command: 0A E4 08 01 5F 50 02 1C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 70 A1 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V21B.CMM, 0
Command: 0A E4 08 02 5F 50 02 1B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 70 B4 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V21D.CMM, 0
Command: 0A E4 08 02 5F 50 02 1D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 70 C4 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
/// CL Detection function is Disabled autonomuously
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The wait state above is required by the CSP electronics
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Power the CL TMP HTR OFF 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_OFF_CL.CMM, 0
Command: 0A E1 07 01 5F 50 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 70 D4 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 70 DD 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_OFF_CL.CMM, 0
Command: 0A E1 07 02 5F 50 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 70 E6 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 70 EF 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the CL valves DV56A-B
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V56A.CMM, 0
Command: 0A E4 08 01 5F 50 05 6A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 70 F8 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V56B.CMM, 0
Command: 0A E4 08 02 5F 50 05 6B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 0B 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the Moog Valves DV22C & D from CSP_N and CSP_R
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22C.CMM, 0
Command: 0A ED 08 01 5F 50 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 1B 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22D.CMM, 0
Command: 0A ED 08 01 5F 50 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 26 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22C.CMM, 0
Command: 0A ED 08 02 5F 50 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 32 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22D.CMM, 0
Command: 0A ED 08 02 5F 50 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 3D 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the Moog Valves DV22A & B from CSP_N and CSP_R
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22A.CMM, 0
Command: 0A ED 08 01 5F 50 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 48 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22B.CMM, 0
Command: 0A ED 08 01 5F 50 02 2B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0 
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 54 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0 
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22A.CMM, 0
Command: 0A ED 08 02 5F 50 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 62 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22B.CMM, 0
Command: 0A ED 08 02 5F 50 02 2B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 6D 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The CL Diconnectors have been opened
/// Sequence to open the CL Diconnectors is finished from CPU_N
/// Nominal CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Nominal CPU is inactive, now Redundant CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_R
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 71 79 1D 46 C3 00 00 71 73 00 06 00 2A 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Redundant CPU is active
/// Sequence to open the CL Diconnectors starts from CPU_R
/// Execute the following steps of the Ramp Down sequence from Step-11 to Step-14, detailed below
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V21A.CMM, 0
Command: 0A E4 08 01 5F 50 02 1A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 80 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V21C.CMM, 0
Command: 0A E4 08 01 5F 50 02 1C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 90 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V21B.CMM, 0
Command: 0A E4 08 02 5F 50 02 1B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 A0 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V21D.CMM, 0
Command: 0A E4 08 02 5F 50 02 1D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 B3 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
/// CL Detection function is Disabled autonomuously
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The wait state above is required by the CSP electronics
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Power the CL TMP HTR OFF 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_NOM_ARM_OFF_CL.CMM, 0
Command: 0A E1 07 01 5F 50 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 C3 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_NOM.CMM, 0
Command: 0A E2 04 01 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 CC 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE1, CSP_ARM_DISARM_HEATER_RED_ARM_OFF_CL.CMM, 0
Command: 0A E1 07 02 5F 50 02 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 D5 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   4:SEND COMMAND                  :CAN-02, CE2, CSP_OPERATE_HEATER_RED.CMM, 0
Command: 0A E2 04 02 
err = 0000
Response: 
   5:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 DE 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the CL valves DV56A-B
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_NOM_ARM_CLOSE_V56A.CMM, 0
Command: 0A E4 08 01 5F 50 05 6A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 71 E7 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_NOM.CMM, 0
Command: 0A E7 04 01 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_NOM.CMM, 0
Command: 0A C9 04 01 
err = 0000
Response: AA AA AA 
   1:SEND COMMAND                  :CAN-02, CE4, CSP_ARM_DISARM_BIL_VALVE_RED_ARM_CLOSE_V56B.CMM, 0
Command: 0A E4 08 02 5F 50 05 6B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 71 F7 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CE7, CSP_OPERATE_BIL_VALVE_RED.CMM, 0
Command: 0A E7 04 02 
err = 0000
Response: 
   4:SEND COMMAND                  :CAN-02, CC9, CSP_GET_VALVES_STATUS_RED.CMM, 0
Command: 0A C9 04 02 
err = 0000
Response: AA AA AA 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the Moog Valves DV22C & D from CSP_N and CSP_R
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22C.CMM, 0
Command: 0A ED 08 01 5F 50 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 72 08 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22D.CMM, 0
Command: 0A ED 08 01 5F 50 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 72 13 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22C.CMM, 0
Command: 0A ED 08 02 5F 50 02 2C 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 72 1E 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22D.CMM, 0
Command: 0A ED 08 02 5F 50 02 2D 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 72 29 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// Close the Moog Valves DV22A & B from CSP_N and CSP_R
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22A.CMM, 0
Command: 0A ED 08 01 5F 50 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0
Command: 0A C5 04 01 
err = 0000
Response: 00 00 72 35 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_NOM_ARM_CLOSE_V22B.CMM, 0
Command: 0A ED 08 01 5F 50 02 2B 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_NOM.CMM, 0 
Command: 0A C5 04 01 
err = 0000
Response: 00 00 72 40 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_NOM.CMM, 0 
Command: 0A EE 04 01 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22A.CMM, 0
Command: 0A ED 08 02 5F 50 02 2A 
err = 0000
Response: 
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 72 4B 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
   1:SEND COMMAND                  :CAN-02, CED, CSP_ARM_DISARM_MOOG_VALVE_RED_ARM_CLOSE_V22B.CMM, 0
Command: 0A ED 08 02 5F 50 02 2B 
err = 0240
   2:SEND COMMAND                  :CAN-02, CC5, CSP_GET_GENERAL_STATUS_RED.CMM, 0
Command: 0A C5 04 02 
err = 0000
Response: 00 00 72 58 2A AA 02 0A AA AA AA AA AA AA AA AA 02 0A AA AA AA AA AA AA AA AA 
   3:SEND COMMAND                  :CAN-02, CEE, CSP_OPERATE_MOOG_VALVE_RED.CMM, 0
Command: 0A EE 04 02 
err = 0000
Response: 
  12:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 60, SEC
/// The CL Diconnectors have been opened
/// Sequence to open the CL Diconnectors is finished from CPU_R
/// Redundant CPU passes to inactive state
   1:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_SUSW.CMM, 0
Command: 0A 14 05 80 
err = 1001 = Error in Command Parameter 1
/// Redundant CPU is inactive, now Nominal CPU passes to active state
   2:SELECT CAB CPU                :UTC-03, CPU_N
  12:SEND COMMAND                  :CAN-02, C14, CAB_JMDC_RESET_TO_APSW.CMM, 0
Command: 0A 14 05 02 
err = 1001 = Error in Command Parameter 1
  13:WAIT N SECONDS/MILLI-SECONDS  :GEP-04, 6, SEC
  14:SEND COMMAND                  :CAN-02, C03, CAB_GET_ESSENTIAL_STATUS.CMM, 0
Command: 0A 03 03 
err = 0000
Response: 01 20 02 01 04 14 32 00 00 72 64 22 3C C3 00 00 72 5E 00 06 00 2D 1F 00 00 07 00 00 6D FD 6D FD C7 2D C7 2D 2B F9 2B F9 98 E0 98 E0 C7 2D 03 5F 5F 5F 50 00 03 00 50 50 
/// Nominal CPU is active
/// The 120V PS primary bus can be powered OFF
   7:REQUEST MESSAGE               :GEP-05, POWER-OFF 120V PS, NONE
/// RAMP UP SEQUENCE is finished
/// After ending the Ramp up sequence, the CAB should be in Cold Redundancy during Steady State
/// Turn the 28V_R primary bus OFF 


